In [25]:
import pandas as pd
week1= pd.read_csv('Restaurant - Week 1 Sales.csv')
week2= pd.read_csv('Restaurant - Week 2 Sales.csv')

In [27]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [ ]:
# select Week1. Customer ID, Week1.Food ID, Week2.Food ID
# from 
# Week1 
# Inner Join Week2 
# ON (Week1.Customer ID = Week2.Customer ID)

In [30]:
week1.merge(week2,how="inner",on="Customer ID",suffixes =[' - Week 1',' - Week 2'])

    Customer ID  Food ID - Week 1  Food ID - Week 2
0           537                 9                 5
1           155                 9                 3
2           155                 1                 3
3           503                 5                 8
4           503                 5                 9
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

In [31]:
week1[week1["Customer ID"]==155]

    Customer ID  Food ID
4           155        9
17          155        1

In [32]:
week2[week2["Customer ID"]==155]

     Customer ID  Food ID
208          155        3

In [ ]:
# select Week1. Customer ID, Week1.Food ID, Week2.Food ID
# from 
# Week1 
# Inner Join Week2 
# ON (Week1.Customer ID = Week2.Customer ID AND Week1.Food ID = week2.Food ID)

In [33]:
week1.merge(week2,how="inner",on=["Customer ID","Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [ ]:
# select Week1. Customer ID, Week1.Food ID, Week2.Food ID
# from 
# Week1 
# full outer Join Week2 
# ON (Week1.Customer ID = Week2.Customer ID)

In [37]:
merged= week1.merge(week2,how="outer",on="Customer ID",suffixes =['- Week 1',' - Week 2'], indicator=True)

In [38]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64